================================================================================
Relative properties
================================================================================

Example := Rectangle {
    foo := Rectangle {
        x: 42px;
    }
     x: foo.x;
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (component_item
        (type_identifier)
        (type_identifier)
        (comp_body
          (assign_property
            (identifier)
            (int_literal)
            (units))))
      (assign_property
        (identifier)
        (scoped_identifiers
          (type_identifier)
          (identifier))))))

================================================================================
Ternary Expression
================================================================================

Example := Window {
    Rectangle {
        background: true ? 5 : 4;
    }
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (component_item
        (type_identifier)
        (comp_body
          (assign_property
            (identifier)
            (ternary_expression
              (bool_literal)
              (int_literal)
              (int_literal))))))))

================================================================================
Chained ternary Expression
================================================================================

Example := Window {
    Rectangle {
        border-color: !touch.enabled ? #888
            : touch.pressed ? #aaa
            : #555;
    }
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (component_item
        (type_identifier)
        (comp_body
          (assign_property
            (identifier)
            (ternary_expression
              (ternary_expression
                (unary_expression
                  (scoped_identifiers
                    (type_identifier)
                    (identifier)))
                (color_literal)
                (scoped_identifiers
                  (type_identifier)
                  (identifier)))
              (color_literal)
              (color_literal))))))))

================================================================================
Arrays as expressions
================================================================================

Example := Window {
    property<[int]> list-of-int: [1,2,3];
}

--------------------------------------------------------------------------------

))))))))))))))))))))))))))))

================================================================================
String expression
================================================================================

Example := Text {
    text: "hello";
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (assign_property
        (identifier)
        (string_literal)))))

================================================================================
Color expression
================================================================================

Example := Window {
    property<color> c1: #ffaaff;
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (define_assign_property
        (type_identifier)
        (identifier)
        (color_literal)))))

================================================================================
Brush expression
================================================================================

Example := Window {
    property<brush> b2: Colors.red;
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (define_assign_property
        (type_identifier)
        (identifier)
        (scoped_identifiers
          (type_identifier)
          (identifier))))))

================================================================================
Function expression
================================================================================

Example := Window {
    property<brush> b2: brighter(55);
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (define_assign_property
        (type_identifier)
        (identifier)
        (function_call
          (identifier)
          (function_call_args
            (int_literal)))))))

================================================================================
Image expression
================================================================================

Example := Window {
    some_image: @image-url("https://slint-ui.com/logo/slint-logo-full-light.svg");
}

--------------------------------------------------------------------------------

(source_file
  (component_definition
    (user_type_identifier)
    (user_type_identifier)
    (field_declaration_list
      (field_declaration_list_body
        (variable_set_equal
          (var_identifier)
          (assignment_prec_operator)
          (function_call
            (function_identifier)
            (call_signature
              (formal_parameters
                (formal_parameter
                  (string
                    (string_fragment)))))))))))

================================================================================
Empty expression block
================================================================================

Example := Window {
    clicked => { }
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (call_back_handler
        (function_identifier)
        (handler_body)))))

================================================================================
Empty expression with semi-colon
================================================================================

Example := Window {
    clicked => { ; }
}

--------------------------------------------------------------------------------

(source_file
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (call_back_handler
        (function_identifier)
        (handler_body)))))

================================================================================
Complicated expression
================================================================================

// (42 + ((5 * 3) / 2)) - (1 * 2);

Example := Rectangle {
    x: 42 + 5 * 3 / 2 - 1 * 2;
}

--------------------------------------------------------------------------------

(source_file
  (comment)
  (component_item
    (type_identifier)
    (type_identifier)
    (comp_body
      (assign_property
        (identifier)
        (binary_expression
          (binary_expression
            (int_literal)
            (binary_expression
              (binary_expression
                (int_literal)
                (int_literal))
              (int_literal)))
          (binary_expression
            (int_literal)
            (int_literal)))))))
